DataProcessors/ConfigurationUpdate.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<DataProcessor>
		<Properties>
			<Name>ConfigurationUpdate</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>EmailAddress</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RestoreInfobase</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SendReportToEMail</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UpdateDateTime</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SaveUpdatesServerPassword</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>InfobaseBackupDirectoryName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UpdateFileName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UseScheduleForUpdateCheck</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UpdateSource</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SchedulerTaskCode</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UpdateServerUserCode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>NeedUpdateFile</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UpdatesServerPassword</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SecondStart</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CheckUpdateExistsOnStart</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ScheduleOfUpdateExistsCheck</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UpdateMode</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UpdateResult</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CreateBackup</Name>
					<Comment>0 - don't create; 1 - temporary; 2 - in the specified directory</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TechnicalErrorInfo</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>AvailableUpdates</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Configuration</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Vendor</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Version</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Version1Digit</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Version2Digit</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Version3Digit</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Version4Digit</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>VersionForUpdate</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PathToUpdateFile</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>UpdateFile</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>UpdateFileSize</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PathToLocalFile</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PathToLocalUpdateFile</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>LocalRelativeDirectory</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ITSDiskNumber</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PlatformVersion</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/ConfigurationUpdate/Forms/ScheduleSetup/Ext/Form/Module.bsl
#Region FormEventsHandlers

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	If Parameters.Property("AutoTest") Then // Return if the form for analysis is received.
		Return;
	EndIf;
	
	ConfigurationUpdateOptions = ConfigurationUpdate.GetSettingsStructureOfAssistant();
	FillPropertyValues(Object, ConfigurationUpdateOptions);
	Object.ScheduleOfUpdateExistsCheck = CommonUseClientServer.StructureIntoSchedule(Object.ScheduleOfUpdateExistsCheck);
	
	SetScheduleVisible(ThisObject);
	
EndProcedure

#EndRegion

#Region HeaderFormItemsEventsHandlers

&AtClient
Procedure CheckUpdateExistsOnStartOnChange(Item)
	
	SetScheduleVisible(ThisObject);
	
EndProcedure

&AtClient
Procedure LabelOpenScheduleClick(Item)
	
	If Object.ScheduleOfUpdateExistsCheck = Undefined Then
		Object.ScheduleOfUpdateExistsCheck = New JobSchedule;
	EndIf;
	Dialog = New ScheduledJobDialog(Object.ScheduleOfUpdateExistsCheck);
	NotifyDescription = New NotifyDescription("LabelOpenScheduleClickEnd", ThisObject);
	Dialog.Show(NOTifyDescription);
	
EndProcedure

#EndRegion

#Region FormCommandsHandlers

&AtClient
Procedure CommandOK(Command)
	
	ClearMessages();
	SettingsChanged = (Parameters.CheckUpdateExistsOnStart <> Object.CheckUpdateExistsOnStart
		AND (Parameters.CheckUpdateExistsOnStart = 1 OR Object.CheckUpdateExistsOnStart = 1))
		OR String(Parameters.ScheduleOfUpdateExistsCheck) <> String(Object.ScheduleOfUpdateExistsCheck);
		
	If SettingsChanged Then
		RepeatPeriodInDay = Object.ScheduleOfUpdateExistsCheck.RepeatPeriodInDay;
		If RepeatPeriodInDay > 0 AND RepeatPeriodInDay < 60 * 5 Then
			CommonUseClientServer.MessageToUser(NStr("en = 'Checking interval can not be less then 5 minutes.'"));
			Return;
		EndIf;
		
		ConfigurationUpdateOptions = ApplicationParameters["StandardSubsystems.ConfigurationUpdateOptions"];
		ConfigurationUpdateOptions.CheckUpdateExistsOnStart = Object.CheckUpdateExistsOnStart;
		ConfigurationUpdateOptions.UpdateServerUserCode = Object.UpdateServerUserCode;
		ConfigurationUpdateOptions.UpdatesServerPassword = ?(Object.SaveUpdatesServerPassword, Object.UpdatesServerPassword, "");
		ConfigurationUpdateOptions.SaveUpdatesServerPassword = Object.SaveUpdatesServerPassword;
		ConfigurationUpdateOptions.ScheduleOfUpdateExistsCheck = CommonUseClientServer.ScheduleIntoStructure(Object.ScheduleOfUpdateExistsCheck);
		
		WriteSettings(ConfigurationUpdateOptions);
		ConfigurationUpdateClient.EnableDisableCheckOnSchedule(Object.CheckUpdateExistsOnStart = 1 AND
			Object.ScheduleOfUpdateExistsCheck <> Undefined);
		
	EndIf;
	
	Close();
	
EndProcedure

&AtClient
Procedure GetUserCodeAndPassword(Command)
	
	GotoURL(
		ConfigurationUpdateClient.GetUpdateParameters().InfoAboutObtainingAccessToUserSitePageAddress);
	
EndProcedure

#EndRegion

#Region ServiceProceduresAndFunctions

&AtClientAtServerNoContext
Procedure SetScheduleVisible(Form)
	
	LabelOpenSchedule = Form.Items.LabelOpenSchedule;
	LabelOpenSchedule.Title = LabelTextOpenSchedule(Form);
	
	If Form.Object.CheckUpdateExistsOnStart = 1 Then
		LabelOpenSchedule.Enabled = True;
	Else
		LabelOpenSchedule.Enabled = False;
	EndIf;
	
EndProcedure

&AtClientAtServerNoContext
Function LabelTextOpenSchedule(Form)
	
	StringPresentationSchedule = String(Form.Object.ScheduleOfUpdateExistsCheck);
	Return ?(NOT IsBlankString(StringPresentationSchedule),
		StringPresentationSchedule, NStr("en = 'Not defined'"));
		
EndFunction

&AtClientAtServerNoContext
Function WriteSettings(ConfigurationUpdateOptions)
	
	ConfigurationUpdateServerCall.WriteStructureOfAssistantSettings(ConfigurationUpdateOptions);
	RefreshReusableValues(); // Reset the cache to apply settings.
	
EndFunction

&AtClient
Procedure LabelOpenScheduleClickEnd(Schedule, AdditionalParameters) Export
	
	If Schedule <> Undefined Then
		Object.ScheduleOfUpdateExistsCheck = Schedule;
	EndIf;
	
	Items.LabelOpenSchedule.Title = LabelTextOpenSchedule(ThisObject);
	
EndProcedure

&AtClient
Procedure OnClose()
	
	Notify("ConfigurationUpdateSettingFormIsClosed");
	
EndProcedure

#EndRegion
